import { useRecoilState } from "recoil";
import { currentGenreModalState } from "src/Store/SelectGenreAtom";
import styled from "styled-components";
import HomeGenreItem from "./HomeGenreItem";

const HomeGenreWrap = styled.div`
  width: 1170px;
  height: 380px;
  margin: 0px auto;
  margin-top: 50px;
  margin-bottom: 50px;
`;

const HomeGenreForm: React.FC = () => {
  const [genreModalState, setGenreModalState] = useRecoilState(
    currentGenreModalState
  );

  return (
    <HomeGenreWrap>
      {genreModalState.isClassic && (
        <HomeGenreItem
          title={"클래식"}
          subTitle={"Classical"}
          explain={
            "사전적 의미의 클래식은 ‘고전’이라는 뜻이다. 고전이란 오랜 시간을 이겨내고 지금까지 우리 곁에 있는 예술을 말한다. 사실 클래식의 기원은 로마 최상위 계급을 일컫는 ‘클래시쿠스’에서 찾을 수 있다. 그들만이 즐기던 귀족 음악이었던 것이다. 그러나 시간이 지나면서 클래식은 점차 여러 사람들의 문화적 향유물로 변모한다. 클래식은 큰 의미로는 문학, 음악, 미술 등 전방위적인 고차원적 예술을 말하고, 작은 의미로는 어느 특정한 시기의 음악을 말한다.   점차 보통 고전음악이라 해석하는 것을 클래식이라고 하는데, 음악사로 보면 하이든, 모차르트, 베토벤 등이 활동한 17~18세기를 말한다. 더불어 서양음악사에서 가장 많은 비중을 차지하고 있는 시대는 볼프강 아마데우스 모차르트(1756-1791)와 루드비히 반 베토벤(1770-1827)이 활동한 고전시대와 프레드릭 쇼팽(1810-1849), 프란츠 리스트(1811-1886)등이 활동한 로맨틱 낭만시대이다."
          }
        />
      )}
      {genreModalState.isRock && (
        <HomeGenreItem
          title={"락"}
          subTitle={"Rock"}
          explain={
            "락의 시초는 블루스이며 1930년대 로버트존슨이 개발한 리듬이 시초가 된다. 하지만 로버트 존슨이 약혼녀에게 독살 당하고 그가 개발한 리듬은 오랫동안 알려지지 않다가, 그에게 영향을 받은 50년대 척베리 등과 같은 블루스 뮤지션들이 그의 리듬을 발전시켜 락앤롤의 선구적인 역할을 한다. 동시대의 엘비스 프레슬리, 제리 리 루이스 같은 락앤롤 뮤지션들의 노래는 젊은 이들을 크게 열광시킨다. 그러나 이러한 현상은 당시의 기성 세대들에겐 큰 충격이었다. 관습적으로 락이 악마의 음악이라고 불리는 이유가 있다. 대표적으로 락 이전에 존재했던 블루스는 악마의 음악으로 불리었다. 그 이유는 흑인들의 음악이었기 때문이다. 그 시대에 흑인들에 대한 차별은 상상을 불허하여 그들이 하는 모든것은 매도되기 일수였기 때문이다. 음악도 그 굴레에서 벗어날수 없었기 때문에 블루스는 '악마의 음악'이라고 매도되었다. 이때문에 재즈같은 경우는 어느정도 즐기는 백인들이 적잖게 있었지만 흑인들의 한이 담긴 블루스를 즐기고 연주하는 백인들은 찾기 힘들었다."
          }
        />
      )}
      {genreModalState.isBallade && (
        <HomeGenreItem
          title={"발라드"}
          subTitle={"Ballade"}
          explain={
            "발라드는 대중 음악의 한 부류로, 남녀간의 사랑을 주제로 한 감상적인 노래를 지칭하며, 느린 박자와 낭만적이고 감성적인 가사를 지닌 노래와 때로는 약간 빠르면서도 반복적이고 서술적인 노래를 포함한다. 발라드는 랩과 반대로 대체적으로 조용한 음악이다. 발라드라는 이름은 이야기 형태의 시나 악곡을 지칭하던 발라드에서 유래하였다. 이 말의 본래 뜻은 '스토리를 가진 노래'이며, '담시'(譚詩)라고 번역되기도 한다. 트래디셔널 포크송에서는 특히 중요한 위치를 차지하는 것이 이 발라드이다. 매스컴이 발달하기 이전 사람들은 흥미있는 사진이나 재미있는 이야기를 노래로 하여 서로 전하였다. 즉 발라드는 오늘날의 신문이나 소설책의 역할을 한 것으로, 민중생활 속에 깊이 뿌리를 박고 있었다. 특히 스코틀랜드나 북부 잉글랜드는 발라드의 전통이 풍부하였는데, 그것이 이민에 의하여 미국에 전해져 여러 형태로 변하면서 노래되어 왔다. 서던 마운틴은 특히 발라드를 수없이 전하고 있는 지방이기도 하다. 영국에서 기원하여 전승된 발라드 305종을 19세기 말엽 프랜시스 제임스 차일드라는 학자가 수집하고 정리하였다. 여기에는 주요 전승 발라드가 대부분 포함되어 있으며, 이 305종을 차일드 발라드 라고 하여 지금도 발라드 연구의 중요한 열쇠가 되고 있다."
          }
        />
      )}
      {genreModalState.isHiphop && (
        <HomeGenreItem
          title={"힙합"}
          subTitle={"Hip-Hop"}
          explain={
            "힙합(Hip Hop)은 1970년대 미합중국 뉴욕의 브롱스에서 유행하기 시작한 춤과 대중음악으로부터 파생된 거리문화이다. 또한 미합중국 뉴욕의 브롱스에서 아프리카계 미국인과 캐리비안 미합중국인, 히스패닉계 주민의 커뮤니티에서 행해지고 있었던 블록 파티에서 태어난 문화이다. 힙합은 랩, 비보잉, 크래피티, 비트박스, (디제잉) 크게 4요소로 이루어져 있다.아프리카계 미합중국인들의 문화 (음악, 패션, 예술) 등 전반적인 삶의 양식을 조합하여 새로운 스타일을 만들어 내는 방식을 힙합 (Hip도 Hop도 튀는, 생기있고 활발하게 움직인다 라는 뜻의 약동하는 의미를 갖고 있다.) 이라고 호칭하기 시작하였으며, 이때가 1974년 11월이었다. 그리고 이것으로 하여 11월을 ‘힙합 역사의 달’(영어: Hip Hop History Month)로 축하하는 관습이 생겨났다. 힙합의 초기에는 팝, 펑크, 레게, 소울, 재즈 등 대중음악에서 추출한 샘플링이나 프로그래밍을 중심으로 한 트랙을 녹음해서 블록파티에 즉흥적인 춤판에 쓰다가, 음악을 틀던 DJ들은 곡 몇 가지 부분에 관중들을 향해 분위기를 맞추기 위해 이런 저런 말들이나 후렴구 도는 미사여구들을 뱉었는데, 그것이 차차 디제이로부터 분화되어 스테이지 위에서 사회를 보는 역할이 따로 만들어져 MC 또는 래퍼가 생겨났고, 그렇게 랩이라는 개념이 탄생하였다."
          }
        />
      )}
    </HomeGenreWrap>
  );
};

export default HomeGenreForm;
